module.exports.errorAnswers = errorAnswers = {
  gettingCardsError: 'Невозможно получить карточки',
  gettingUsersError: 'Невозможно получить пользователей',
  userIdError: 'Невозможно найти пользователя по id',
  cardIdError: 'Невозможно найти пользователя по id',
  creationCardError: 'Невозможно создать карточку. Переданы некорректные данные',
  creationUserError: 'Невозможно создать пользователя. Переданы некорректные данные',
  updatingUserError: 'Невозможно обновить данные пользователя. Переданы некорректные данные, либо задан неверный id пользователя',
  updatingAvatarError: 'Невозможно обновить аватар пользователя. Переданы некорректные данные, либо задан неверный id пользователя',
  removingCardError: 'Невозможно удалить карточку. Задан неверный id карточки',
  settingLikeError: 'Невозможно поставить лайк карточке. Переданы некорректные данные, либо задан неверный id карточки',
  removingLikeError: 'Невозможно снять лайк с карточки. Переданы некорректные данные, либо задан неверный id карточки',
  invalidIdError: 'Заданный id параметр в запросе некорректный'
};


module.exports.logFile = logFile ='logs/Logs.log';